Kozak24/SmartChess/GRBL.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Tx_Int.h"
#include "Timer1_Ovf_Int.h"
#include "Timer0.h"
#include "Clock1.h"
#include "Clock0.h"
#include "Timer1.h"
#include "Timer0_Comp_Int.h"
#include "Timer0_Ovf_Int.h"
#include "UART.h"
#include "Limit_Pins.h"
#include "Limit_Pins_aliases.h"
#include "Control_Pins.h"
#include "Control_Pins_aliases.h"
#include "Limit_Int.h"
#include "Control_Int.h"
#include "Pin_Step_X.h"
#include "Pin_Step_X_aliases.h"
#include "WDT_Int.h"
#include "Em_EEPROM.h"
#include "Debug_Red_Pin.h"
#include "Debug_Red_Pin_aliases.h"
#include "Rx_Int.h"
#include "Control_Reg_Step.h"
#include "Pin_Step_Z.h"
#include "Pin_Step_Z_aliases.h"
#include "Pin_Step_Y.h"
#include "Pin_Step_Y_aliases.h"
#include "Control_Reg_Direction.h"
#include "Pin_Direction_X.h"
#include "Pin_Direction_X_aliases.h"
#include "Pin_Direction_Y.h"
#include "Pin_Direction_Y_aliases.h"
#include "Pin_Direction_Z.h"
#include "Pin_Direction_Z_aliases.h"
#include "UART_IntClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

